class Solution:
    def numTrees(self, n: int) -> int:
        dp=[1]*(n+1)
        for i in range(2,n+1):
            dp[i] = sum(dp[j - 1] *dp[i - j] for j in range(1, i + 1))
        return dp[n]
    
#     Бодлогын санаа

# Бидэнд n ширхэг ялгаатай утгатай зангилаанууд өгөгдсөн (1, 2, 3, …, n).
# Даалгавар: эдгээрээс үүсч болох модны бүтцийн хувьд ялгаатай BST (Binary Search Tree) хэдэн ширхэг байхыг тооцох.
    
# dp[i] = i зангилаатай BST үүсгэх ялгаатай бүтцийн тоо гэж тодорхойлоё.

# Тэгвэл:

# Хэрвээ бид j-г root гэж авбал:
# Зүүн талд j-1 зангилаа үлдэнэ.
# Баруун талд i-j зангилаа үлдэнэ.

# BST-ийн бүтэц зүүн ба баруун модны бүтэц дээр бүрэн хамаардаг тул:
#     dp[i]=j=1∑i​dp[j−1]×dp[i−j]

# Алгоритмын алхмууд

# Суурь нөхцөл:
# dp[0] = 1 (хоосон мод)
# dp[1] = 1 (ганц root-тэй мод)

# Давталт:
# i = 2 → n хүртэл

# Root бүрийн хувьд (j = 1..i):
# dp[j-1] × dp[i-j] = тухайн root-тэй бүх бүтцийн тоо
# Бүгдийг нэмж, dp[i]-д хадгална.

# Хариу:
# dp[n] — n зангилаатай BST-ийн нийт бүтэцийн тоо.