from typing import List

class Solution:
    def maxSubArray(self, nums: List[int]) -> int:
        s = m = nums[0]
        for x in nums[1:]:
            s = max(x, s + x)
            m = max(m, s)
        return m
    
# Асуулт: Integer төрлийн nums гэдэг массив өгөгдсөн. хамгийн их нийлбэртэй subarray-г олох ба нийлбэрийг буцаана.

# Бодолт:

# s → одоогийн нийлбэр
# m → одоо хүртэлх хамгийн их нийлбэр

# Давталт бүрд s=max(x, s+x) — шинэ элементийг дангаар авах уу эсвэл өмнөх нийлбэрт нэмэх үү гэдгийг шийддэг.

# Дараа нь m=max(m, s) — хамгийн ихийг шинэчилнэ.

# Эцэст нь m бол хамгийн их нийлбэртэй хэсэг массивын нийлбэр.